app/Controllers/CartController.php

    public function view()
    {
    // Sepetteki ürünleri çek
    $ci_session = session()->get('ci_session');

    $cartModel = new CartModelLocal();
    $cartItems = $cartModel->where('ci_session', $ci_session)->findAll();
---
SELECT *
FROM `cart`
WHERE `ci_session` IS NULL